
[
  {
    "id": "purpose_q1",
    "category": "1.0-network-fundamentals",
    "question_es": "Una dirección IP funciona de manera similar a una dirección postal, ya que no solo identifica un dispositivo final, sino también dónde se encuentra dentro de la red.",
    "question_en": "An IP address functions similarly to a postal address, as it not only identifies an end device but also where it is located within the network.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "Correcto. La dirección IP tiene una doble función: identificar un host específico (como el destinatario en una carta) y su ubicación en la red (como la calle y ciudad), lo cual es esencial para el enrutamiento.",
    "explanation_en": "Correct. The IP address has a dual function: identifying a specific host (like the recipient on a letter) and its location on the network (like the street and city), which is essential for routing."
  },
  {
    "id": "purpose_q2",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuál describe mejor la función principal y dual de una dirección IPv4 en una red?",
    "question_en": "Which best describes the primary dual function of an IPv4 address on a network?",
    "options": [
      { "text_es": "Asignar nombres de dominio a los servidores.", "text_en": "Assigning domain names to servers.", "isCorrect": false },
      { "text_es": "Identificar el fabricante del hardware de red.", "text_en": "Identifying the network hardware manufacturer.", "isCorrect": false },
      { "text_es": "Identificar un dispositivo único y su ubicación lógica en la red.", "text_en": "Identifying a unique device and its logical location on the network.", "isCorrect": true },
      { "text_es": "Garantizar la seguridad física del cableado de red.", "text_en": "Ensuring the physical security of network cabling.", "isCorrect": false }
    ],
    "explanation_es": "La dirección IP es fundamental para identificar unívocamente una interfaz de host y su ubicación en la red, permitiendo así que los paquetes de datos sean dirigidos (enrutados) correctamente hacia él.",
    "explanation_en": "The IP address is fundamental for uniquely identifying a host interface and its location on the network, thus allowing data packets to be correctly directed (routed) to it."
  },
  {
    "id": "purpose_q3",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuál de las siguientes opciones NO es una función principal o propósito directo de una dirección IP?",
    "question_en": "Which of the following is NOT a primary function or direct purpose of an IP address?",
    "options": [
      { "text_es": "Permitir el enrutamiento de paquetes a través de diferentes redes.", "text_en": "Allowing packet routing across different networks.", "isCorrect": false },
      { "text_es": "Identificar de forma única una interfaz de red dentro de su red local.", "text_en": "Uniquely identifying a network interface within its local network.", "isCorrect": false },
      { "text_es": "Indicar la ubicación lógica de un dispositivo en la topología de red.", "text_en": "Indicating the logical location of a device in the network topology.", "isCorrect": false },
      { "text_es": "Traducir nombres de dominio (como www.google.com) a direcciones numéricas.", "text_en": "Translating domain names (like www.google.com) to numerical addresses.", "isCorrect": true }
    ],
    "explanation_es": "La traducción de nombres de dominio a direcciones IP es función del sistema DNS (Domain Name System), no de la dirección IP en sí misma. Las direcciones IP se centran en la identificación y localización para el enrutamiento.",
    "explanation_en": "Translating domain names to IP addresses is the function of the DNS (Domain Name System), not the IP address itself. IP addresses focus on identification and location for routing."
  },
  {
    "id": "purpose_q4",
    "category": "1.0-network-fundamentals",
    "question_es": "Sin direcciones IP, sería imposible enviar datos entre computadoras que se encuentran en redes diferentes (por ejemplo, a través de Internet).",
    "question_en": "Without IP addresses, it would be impossible to send data between computers located on different networks (e.g., across the Internet).",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "Correcto. Las direcciones IP proporcionan la información de localización necesaria para que los routers puedan tomar decisiones y reenviar paquetes entre distintas redes. Sin ellas, el enrutamiento a gran escala no funcionaría.",
    "explanation_en": "Correct. IP addresses provide the necessary location information for routers to make decisions and forward packets between different networks. Without them, large-scale routing would not work."
  },
  {
    "id": "purpose_q5",
    "category": "1.0-network-fundamentals",
    "question_es": "Un usuario en la red A quiere enviar un correo electrónico a un servidor en la red B. ¿Qué información utiliza principalmente el router entre la red A y la red B para dirigir el paquete hacia la red correcta?",
    "question_en": "A user on network A wants to send an email to a server on network B. What information does the router between network A and network B primarily use to direct the packet towards the correct network?",
    "options": [
      { "text_es": "La dirección MAC del servidor de correo.", "text_en": "The MAC address of the mail server.", "isCorrect": false },
      { "text_es": "La dirección IP de destino (del servidor de correo).", "text_en": "The destination IP address (of the mail server).", "isCorrect": true },
      { "text_es": "El número de puerto TCP utilizado por el correo electrónico.", "text_en": "The TCP port number used by email.", "isCorrect": false },
      { "text_es": "El nombre de usuario del destinatario del correo.", "text_en": "The username of the email recipient.", "isCorrect": false }
    ],
    "explanation_es": "Los routers operan en la capa de red y utilizan la dirección IP de destino para determinar la ruta y la red hacia la cual reenviar el paquete. La IP proporciona la información de localización necesaria.",
    "explanation_en": "Routers operate at the network layer and use the destination IP address to determine the route and the network to forward the packet to. The IP provides the necessary location information."
  },
  {
    "id": "purpose_q6",
    "category": "1.0-network-fundamentals",
    "question_es": "El propósito fundamental de tener direcciones IP únicas para cada dispositivo conectado a Internet es:",
    "question_en": "The fundamental purpose of having unique IP addresses for each device connected to the Internet is:",
    "options": [
      { "text_es": "Para que los fabricantes puedan rastrear sus dispositivos vendidos.", "text_en": "So manufacturers can track their sold devices.", "isCorrect": false },
      { "text_es": "Para asegurar que los datos enviados lleguen al destino correcto y no a otro dispositivo.", "text_en": "To ensure that sent data reaches the correct destination and not another device.", "isCorrect": true },
      { "text_es": "Para limitar la cantidad de dispositivos que pueden conectarse a una red.", "text_en": "To limit the number of devices that can connect to a network.", "isCorrect": false },
      { "text_es": "Para determinar la velocidad de conexión del dispositivo.", "text_en": "To determine the device's connection speed.", "isCorrect": false }
    ],
    "explanation_es": "La unicidad de las direcciones IP (en su contexto) es crucial para asegurar que cada dispositivo tenga una identidad y ubicación claras, garantizando así la entrega correcta de los datos al destinatario deseado.",
    "explanation_en": "The uniqueness of IP addresses (in their context) is crucial to ensure that each device has a clear identity and location, thus guaranteeing the correct delivery of data to the intended recipient."
  },
  {
    "id": "purpose_q7",
    "category": "1.0-network-fundamentals",
    "question_es": "La dirección IP de un dispositivo puede cambiar (por ejemplo, si se mueve a otra red), pero su propósito sigue siendo identificarlo y localizarlo en su red actual.",
    "question_en": "A device's IP address can change (e.g., if it moves to another network), but its purpose remains to identify and locate it on its current network.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "Correcto. Las direcciones IP son direcciones lógicas y pueden cambiar. Sin embargo, independientemente de la dirección específica asignada, su función constante es servir como identificador y localizador del dispositivo dentro de la red a la que está conectado en ese momento.",
    "explanation_en": "Correct. IP addresses are logical addresses and can change. However, regardless of the specific address assigned, their constant function is to serve as an identifier and locator for the device within the network it is currently connected to."
  },
  {
    "id": "purpose_q8",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Qué capa del modelo OSI se encarga principalmente del direccionamiento lógico utilizando direcciones IP para el enrutamiento entre redes?",
    "question_en": "Which layer of the OSI model is primarily responsible for logical addressing using IP addresses for inter-network routing?",
    "options": [
      { "text_es": "Capa 1 - Física", "text_en": "Layer 1 - Physical", "isCorrect": false },
      { "text_es": "Capa 2 - Enlace de Datos", "text_en": "Layer 2 - Data Link", "isCorrect": false },
      { "text_es": "Capa 3 - Red", "text_en": "Layer 3 - Network", "isCorrect": true },
      { "text_es": "Capa 4 - Transporte", "text_en": "Layer 4 - Transport", "isCorrect": false }
    ],
    "explanation_es": "La Capa de Red (Layer 3) es responsable del direccionamiento lógico (IP) y el enrutamiento de paquetes a través de múltiples redes. Las direcciones IP son el componente clave para esta función.",
    "explanation_en": "The Network Layer (Layer 3) is responsible for logical addressing (IP) and routing packets across multiple networks. IP addresses are the key component for this function."
  },
  {
    "id": "purpose_q9",
    "category": "1.0-network-fundamentals",
    "question_es": "Considerando el propósito fundamental de las direcciones IP, ¿cuál de estas afirmaciones es INCORRECTA?",
    "question_en": "Considering the fundamental purpose of IP addresses, which of these statements is INCORRECT?",
    "options": [
      { "text_es": "Las direcciones IP permiten la comunicación global en Internet.", "text_en": "IP addresses enable global communication on the Internet.", "isCorrect": false },
      { "text_es": "Cada dispositivo necesita una dirección IP para ser identificado en una red IP.", "text_en": "Every device needs an IP address to be identified on an IP network.", "isCorrect": false },
      { "text_es": "Las direcciones IP son direcciones físicas grabadas permanentemente en el hardware.", "text_en": "IP addresses are physical addresses permanently burned into the hardware.", "isCorrect": true },
      { "text_es": "Las direcciones IP ayudan a los routers a decidir dónde enviar los paquetes de datos.", "text_en": "IP addresses help routers decide where to send data packets.", "isCorrect": false }
    ],
    "explanation_es": "Las direcciones IP son direcciones lógicas, no físicas. Las direcciones físicas grabadas en el hardware son las direcciones MAC (Capa 2). El propósito de la IP es la identificación y localización lógica en la red (Capa 3).",
    "explanation_en": "IP addresses are logical, not physical addresses. The physical addresses burned into hardware are MAC addresses (Layer 2). The purpose of IP is logical identification and location on the network (Layer 3)."
  },
  {
    "id": "purpose_q10",
    "category": "1.0-network-fundamentals",
    "question_es": "Si una página web tarda mucho en cargar, ¿cuál de las siguientes opciones está directamente relacionada con el propósito fundamental de la dirección IP del servidor web?",
    "question_en": "If a webpage takes a long time to load, which of the following is directly related to the fundamental purpose of the web server's IP address?",
    "options": [
      { "text_es": "La dirección IP asegura que tu navegador sabe a qué servidor específico (identificación) y a qué ubicación de red (localización) enviar la solicitud de la página.", "text_en": "The IP address ensures your browser knows which specific server (identification) and network location (localization) to send the page request to.", "isCorrect": true },
      { "text_es": "La dirección IP determina la cantidad de publicidad que mostrará la página web.", "text_en": "The IP address determines the amount of advertising the webpage will display.", "isCorrect": false },
      { "text_es": "La dirección IP encripta la conexión entre tu navegador y el servidor web.", "text_en": "The IP address encrypts the connection between your browser and the web server.", "isCorrect": false },
      { "text_es": "La dirección IP mide la velocidad de descarga de tu conexión a Internet.", "text_en": "The IP address measures the download speed of your Internet connection.", "isCorrect": false }
    ],
    "explanation_es": "Aunque muchos factores afectan la velocidad de carga, la dirección IP del servidor es esencial para que tu solicitud inicial llegue al servidor correcto. Su propósito es identificar y localizar ese servidor en Internet, permitiendo que la comunicación se establezca.",
    "explanation_en": "Although many factors affect loading speed, the server's IP address is essential for your initial request to reach the correct server. Its purpose is to identify and locate that server on the Internet, allowing communication to be established."
  },
  {
    "id": "format_q1",
    "category": "1.0-network-fundamentals",
    "question_es": "El formato decimal punteado de IPv4 utiliza cuatro números separados por comas (,).",
    "question_en": "The IPv4 dotted-decimal format uses four numbers separated by commas (,).",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": false },
      { "text_es": "Falso", "text_en": "False", "isCorrect": true }
    ],
    "explanation_es": "Falso. El formato decimal punteado utiliza puntos (.) para separar los cuatro números decimales, no comas.",
    "explanation_en": "False. The dotted-decimal format uses dots (.) to separate the four decimal numbers, not commas."
  },
  {
    "id": "format_q2",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuál es el rango válido para cada uno de los cuatro números en una dirección IPv4 en formato decimal punteado?",
    "question_en": "What is the valid range for each of the four numbers in an IPv4 address in dotted-decimal format?",
    "options": [
      { "text_es": "1 a 256", "text_en": "1 to 256", "isCorrect": false },
      { "text_es": "0 a 255", "text_en": "0 to 255", "isCorrect": true },
      { "text_es": "1 a 128", "text_en": "1 to 128", "isCorrect": false },
      { "text_es": "0 a 1024", "text_en": "0 to 1024", "isCorrect": false }
    ],
    "explanation_es": "Cada uno de los cuatro números (que representan un octeto) en el formato decimal punteado debe ser un valor entre 0 y 255, inclusive.",
    "explanation_en": "Each of the four numbers (representing an octet) in the dotted-decimal format must be a value between 0 and 255, inclusive."
  },
  {
    "id": "format_q3",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuál de las siguientes direcciones IP está escrita en un formato decimal punteado VÁLIDO?",
    "question_en": "Which of the following IP addresses is written in a VALID dotted-decimal format?",
    "options": [
      { "text_es": "192.168.1.256", "text_en": "192.168.1.256", "isCorrect": false },
      { "text_es": "10.0.0", "text_en": "10.0.0", "isCorrect": false },
      { "text_es": "172.16.30.55", "text_en": "172.16.30.55", "isCorrect": true },
      { "text_es": "200.150..10.5", "text_en": "200.150..10.5", "isCorrect": false }
    ],
    "explanation_es": "La opción C es la única que cumple todas las reglas: cuatro números decimales, cada uno entre 0 y 255, separados por puntos simples.",
    "explanation_en": "Option C is the only one that follows all the rules: four decimal numbers, each between 0 and 255, separated by single dots."
  },
  {
    "id": "format_q4",
    "category": "1.0-network-fundamentals",
    "question_es": "La dirección IP 192.168.260.1 es inválida porque:",
    "question_en": "The IP address 192.168.260.1 is invalid because:",
    "options": [
      { "text_es": "Usa puntos en lugar de comas.", "text_en": "It uses dots instead of commas.", "isCorrect": false },
      { "text_es": "Tiene muy pocos números.", "text_en": "It has too few numbers.", "isCorrect": false },
      { "text_es": "Contiene un número mayor a 255.", "text_en": "It contains a number greater than 255.", "isCorrect": true },
      { "text_es": "El primer número no puede ser 192.", "text_en": "The first number cannot be 192.", "isCorrect": false }
    ],
    "explanation_es": "El tercer número (260) excede el valor máximo permitido de 255 para cualquier octeto en el formato decimal punteado.",
    "explanation_en": "The third number (260) exceeds the maximum allowed value of 255 for any octet in the dotted-decimal format."
  },
  {
    "id": "format_q5",
    "category": "1.0-network-fundamentals",
    "question_es": "Una dirección IPv4 en formato decimal punteado siempre debe contener exactamente cuatro números decimales.",
    "question_en": "An IPv4 address in dotted-decimal format must always contain exactly four decimal numbers.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "Correcto. El formato estándar requiere precisamente cuatro números decimales, cada uno representando un octeto de la dirección binaria de 32 bits.",
    "explanation_en": "Correct. The standard format requires precisely four decimal numbers, each representing one octet of the 32-bit binary address."
  },
  {
    "id": "format_q6",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Qué símbolo se utiliza para separar los números en el formato decimal punteado de IPv4?",
    "question_en": "What symbol is used to separate the numbers in the IPv4 dotted-decimal format?",
    "options": [
      { "text_es": "Guion (-)", "text_en": "Hyphen (-)", "isCorrect": false },
      { "text_es": "Dos puntos (:)", "text_en": "Colon (:)", "isCorrect": false },
      { "text_es": "Punto y coma (;)", "text_en": "Semicolon (;)", "isCorrect": false },
      { "text_es": "Punto (.)", "text_en": "Dot (.)", "isCorrect": true }
    ],
    "explanation_es": "El nombre \"decimal punteado\" (dotted-decimal) indica que se usan puntos (.) como separadores entre los cuatro valores decimales.",
    "explanation_en": "The name \"dotted-decimal\" indicates that dots (.) are used as separators between the four decimal values."
  },
  {
    "id": "format_q7",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Por qué es inválida la notación 10.0.0.1.50 como dirección IPv4?",
    "question_en": "Why is the notation 10.0.0.1.50 invalid as an IPv4 address?",
    "options": [
      { "text_es": "Contiene el número 0.", "text_en": "It contains the number 0.", "isCorrect": false },
      { "text_es": "Tiene más de cuatro números decimales.", "text_en": "It has more than four decimal numbers.", "isCorrect": true },
      { "text_es": "Los números son demasiado bajos.", "text_en": "The numbers are too low.", "isCorrect": false },
      { "text_es": "Usa puntos como separadores.", "text_en": "It uses dots as separators.", "isCorrect": false }
    ],
    "explanation_es": "El formato decimal punteado de IPv4 debe tener exactamente cuatro números. Esta notación tiene cinco, lo cual es incorrecto para IPv4.",
    "explanation_en": "The IPv4 dotted-decimal format must have exactly four numbers. This notation has five, which is incorrect for IPv4."
  },
  {
    "id": "format_q8",
    "category": "1.0-network-fundamentals",
    "question_es": "Es válido que los cuatro números en una dirección IP decimal punteada sean 0.0.0.0.",
    "question_en": "It is valid for all four numbers in a dotted-decimal IP address to be 0.0.0.0.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "Correcto. El valor 0 está dentro del rango permitido (0-255) para cada octeto. La dirección 0.0.0.0 es una dirección válida y tiene un significado especial en redes IP.",
    "explanation_en": "Correct. The value 0 is within the allowed range (0-255) for each octet. The address 0.0.0.0 is a valid address and has a special meaning in IP networking."
  },
  {
    "id": "format_q9",
    "category": "1.0-network-fundamentals",
    "question_es": "Al escribir una dirección IPv4, ¿cuál de estas NO sigue las reglas del formato decimal punteado?",
    "question_en": "When writing an IPv4 address, which of these does NOT follow the dotted-decimal format rules?",
    "options": [
      { "text_es": "1.1.1.1", "text_en": "1.1.1.1", "isCorrect": false },
      { "text_es": "255.255.255.255", "text_en": "255.255.255.255", "isCorrect": false },
      { "text_es": "192,168,1,1", "text_en": "192,168,1,1", "isCorrect": true },
      { "text_es": "10.0.40.180", "text_en": "10.0.40.180", "isCorrect": false }
    ],
    "explanation_es": "La opción '192,168,1,1' utiliza comas (,) como separadores en lugar de puntos (.), lo cual viola la regla del formato decimal punteado.",
    "explanation_en": "Option '192,168,1,1' uses commas (,) as separators instead of dots (.), which violates the dotted-decimal format rule."
  },
  {
    "id": "format_q10",
    "category": "1.0-network-fundamentals",
    "question_es": "El formato decimal punteado se utiliza porque es más fácil para los humanos leer y escribir direcciones IP que usar la representación binaria completa de 32 bits.",
    "question_en": "The dotted-decimal format is used because it is easier for humans to read and write IP addresses than using the full 32-bit binary representation.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "Las computadoras usan el formato binario (1 ó 0); el formato decimal punteado fue diseñado para la conveniencia y legibilidad humana.",
    "explanation_en": "Although computers use the binary format (1 or 0); the dotted-decimal format was designed for human convenience and readability."
  },
  {
    "id": "binary_q1",
    "category": "1.0-network-fundamentals",
    "question_es": "Las computadoras y los routers procesan internamente las direcciones IPv4 directamente en el formato decimal punteado (ej. 192.168.1.1).",
    "question_en": "Computers and routers internally process IPv4 addresses directly in the dotted-decimal format (e.g., 192.168.1.1).",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": false },
      { "text_es": "Falso", "text_en": "False", "isCorrect": true }
    ],
    "explanation_es": "Falso. El formato decimal punteado es para la lectura humana. Los dispositivos de red procesan y entienden las direcciones IPv4 como números binarios de 32 bits.",
    "explanation_en": "False. The dotted-decimal format is for human readability. Network devices process and understand IPv4 addresses as 32-bit binary numbers."
  },
  {
    "id": "binary_q2",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuántos bits en total componen una dirección IPv4?",
    "question_en": "How many total bits make up an IPv4 address?",
    "options": [
      { "text_es": "8 bits", "text_en": "8 bits", "isCorrect": false },
      { "text_es": "16 bits", "text_en": "16 bits", "isCorrect": false },
      { "text_es": "32 bits", "text_en": "32 bits", "isCorrect": true },
      { "text_es": "128 bits", "text_en": "128 bits", "isCorrect": false }
    ],
    "explanation_es": "Una dirección IPv4 se define fundamentalmente como un número binario de 32 bits de longitud.",
    "explanation_en": "An IPv4 address is fundamentally defined as a 32-bit long binary number."
  },
  {
    "id": "binary_q3",
    "category": "1.0-network-fundamentals",
    "question_es": "En la estructura de una dirección IPv4, ¿qué es un \"octeto\"?",
    "question_en": "In the structure of an IPv4 address, what is an \"octet\"?",
    "options": [
      { "text_es": "La dirección IP completa en formato decimal.", "text_en": "The complete IP address in decimal format.", "isCorrect": false },
      { "text_es": "Un grupo de 4 bits.", "text_en": "A group of 4 bits.", "isCorrect": false },
      { "text_es": "Un grupo de 8 bits.", "text_en": "A group of 8 bits.", "isCorrect": true },
      { "text_es": "Un identificador único de red.", "text_en": "A unique network identifier.", "isCorrect": false }
    ],
    "explanation_es": "La dirección IPv4 de 32 bits se divide en cuatro secciones iguales. Cada una de estas secciones de 8 bits se denomina octeto.",
    "explanation_en": "The 32-bit IPv4 address is divided into four equal sections. Each of these 8-bit sections is called an octet."
  },
  {
    "id": "binary_q4",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuántos octetos forman una dirección IPv4 completa?",
    "question_en": "How many octets form a complete IPv4 address?",
    "options": [
      { "text_es": "1", "text_en": "1", "isCorrect": false },
      { "text_es": "2", "text_en": "2", "isCorrect": false },
      { "text_es": "4", "text_en": "4", "isCorrect": true },
      { "text_es": "8", "text_en": "8", "isCorrect": false }
    ],
    "explanation_es": "Dado que una dirección IPv4 tiene 32 bits y cada octeto tiene 8 bits (32 / 8 = 4), una dirección IPv4 se compone de cuatro octetos.",
    "explanation_en": "Since an IPv4 address has 32 bits and each octet has 8 bits (32 / 8 = 4), an IPv4 address is composed of four octets."
  },
  {
    "id": "binary_q5",
    "category": "1.0-network-fundamentals",
    "question_es": "Cada número en el formato decimal punteado (ej., el '192' en 192.168.1.1) representa el valor decimal de un octeto binario (8 bits).",
    "question_en": "Each number in the dotted-decimal format (e.g., the '192' in 192.168.1.1) represents the decimal value of a binary octet (8 bits).",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "El formato decimal punteado es una conversión a decimal de cada uno de los cuatro octetos que componen la dirección binaria de 32 bits.",
    "explanation_en": "The dotted-decimal format is a decimal conversion of each of the four octets that make up the 32-bit binary address."
  },
  {
    "id": "binary_q6",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Qué tipo de dígitos componen la representación binaria de una dirección IP que utilizan las computadoras?",
    "question_en": "What type of digits make up the binary representation of an IP address used by computers?",
    "options": [
      { "text_es": "Dígitos del 0 al 9.", "text_en": "Digits 0 through 9.", "isCorrect": false },
      { "text_es": "Dígitos del 0 al 7 (Octal).", "text_en": "Digits 0 through 7 (Octal).", "isCorrect": false },
      { "text_es": "Dígitos 0 y 1 únicamente (Binario).", "text_en": "Digits 0 and 1 only (Binary).", "isCorrect": true },
      { "text_es": "Dígitos del 0 al 9 y letras A-F (Hexadecimal).", "text_en": "Digits 0 through 9 and letters A-F (Hexadecimal).", "isCorrect": false }
    ],
    "explanation_es": "La representación binaria, que es como las máquinas procesan las IPs, utiliza únicamente los dígitos 0 y 1 (bits).",
    "explanation_en": "The binary representation, which is how machines process IPs, uses only the digits 0 and 1 (bits)."
  },
  {
    "id": "binary_q7",
    "category": "1.0-network-fundamentals",
    "question_es": "Si una dirección IPv4 tiene 32 bits, y se divide en octetos, ¿cuántos bits tiene cada octeto?",
    "question_en": "If an IPv4 address has 32 bits, and it is divided into octets, how many bits does each octet have?",
    "options": [
      { "text_es": "4 bits", "text_en": "4 bits", "isCorrect": false },
      { "text_es": "8 bits", "text_en": "8 bits", "isCorrect": true },
      { "text_es": "16 bits", "text_en": "16 bits", "isCorrect": false },
      { "text_es": "32 bits", "text_en": "32 bits", "isCorrect": false }
    ],
    "explanation_es": "Un octeto, por definición en este contexto, es un grupo de 8 bits. Cuatro de estos grupos forman los 32 bits de la dirección IPv4.",
    "explanation_en": "An octet, by definition in this context, is a group of 8 bits. Four of these groups form the 32 bits of the IPv4 address."
  },
  {
    "id": "binary_q8",
    "category": "1.0-network-fundamentals",
    "question_es": "La estructura binaria de 32 bits es específica de IPv4; otros protocolos como IPv6 utilizan una cantidad diferente de bits.",
    "question_en": "The 32-bit binary structure is specific to IPv4; other protocols like IPv6 use a different number of bits.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "La longitud de 32 bits es una característica definitoria de las direcciones IPv4. El protocolo más nuevo, IPv6, utiliza direcciones de 128 bits.",
    "explanation_en": "The 32-bit length is a defining characteristic of IPv4 addresses. The newer protocol, IPv6, uses 128-bit addresses."
  },
  {
    "id": "binary_q9",
    "category": "1.0-network-fundamentals",
    "question_es": "Entender la estructura binaria de las direcciones IP es fundamental para comprender conceptos más avanzados como:",
    "question_en": "Understanding the binary structure of IP addresses is fundamental to comprehending more advanced concepts such as:",
    "options": [
      { "text_es": "El color de los cables de red.", "text_en": "The color of network cables.", "isCorrect": false },
      { "text_es": "El subnetting (cálculo de subredes).", "text_en": "Subnetting (subnet calculation).", "isCorrect": true },
      { "text_es": "La velocidad de la conexión Wi-Fi.", "text_en": "The speed of the Wi-Fi connection.", "isCorrect": false },
      { "text_es": "Las licencias de software del sistema operativo.", "text_en": "Operating system software licenses.", "isCorrect": false }
    ],
    "explanation_es": "El subnetting implica manipular los bits dentro de la dirección IP para dividir redes grandes en redes más pequeñas. Esto requiere una comprensión directa de la estructura binaria de 32 bits y los octetos.",
    "explanation_en": "Subnetting involves manipulating the bits within the IP address to divide large networks into smaller ones. This requires a direct understanding of the 32-bit binary structure and octets."
  },
  {
    "id": "binary_q10",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuál es el valor decimal MÁXIMO que puede representarse con un solo octeto (8 bits)?",
    "question_en": "What is the MAXIMUM decimal value that can be represented with a single octet (8 bits)?",
    "options": [
      { "text_es": "128", "text_en": "128", "isCorrect": false },
      { "text_es": "255", "text_en": "255", "isCorrect": true },
      { "text_es": "256", "text_en": "256", "isCorrect": false },
      { "text_es": "512", "text_en": "512", "isCorrect": false }
    ],
    "explanation_es": "Un octeto tiene 8 bits. El valor máximo se obtiene cuando los 8 bits son '1' (11111111 en binario), lo cual equivale a 255 en decimal. Esto explica por qué cada número en el formato decimal punteado va de 0 a 255.",
    "explanation_en": "An octet has 8 bits. The maximum value is obtained when all 8 bits are '1' (11111111 in binary), which equals 255 in decimal. This explains why each number in the dotted-decimal format ranges from 0 to 255."
  },
  {
    "id": "portions_q1",
    "category": "1.0-network-fundamentals",
    "question_es": "Toda dirección IPv4 se considera lógicamente dividida en exactamente dos partes: la porción de red y la porción de host.",
    "question_en": "Every IPv4 address is logically considered to be divided into exactly two parts: the network portion and the host portion.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "Conceptualmente, cada dirección IP se estructura en dos campos o partes: una que identifica la red y otra que identifica al host dentro de esa red.",
    "explanation_en": "Conceptually, each IP address is structured into two fields or parts: one that identifies the network and another that identifies the host within that network."
  },
  {
    "id": "portions_q2",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Qué identifica la porción de red (network portion) de una dirección IPv4?",
    "question_en": "What does the network portion of an IPv4 address identify?",
    "options": [
      { "text_es": "Un dispositivo específico dentro de una red local.", "text_en": "A specific device within a local network.", "isCorrect": false },
      { "text_es": "El grupo completo de dispositivos que pertenecen a la misma red o subred lógica.", "text_en": "The entire group of devices belonging to the same logical network or subnet.", "isCorrect": true },
      { "text_es": "El fabricante del dispositivo de red.", "text_en": "The manufacturer of the network device.", "isCorrect": false },
      { "text_es": "La velocidad máxima de transmisión de la red.", "text_en": "The maximum transmission speed of the network.", "isCorrect": false }
    ],
    "explanation_es": "La porción de red de la dirección IP sirve para identificar de forma única a la red o subred a la que pertenece el host. Todos los hosts en la misma subred comparten esta porción.",
    "explanation_en": "The network portion of the IP address serves to uniquely identify the network or subnet to which the host belongs. All hosts on the same subnet share this portion."
  },
  {
    "id": "portions_q3",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Qué identifica la porción de host (host portion) de una dirección IPv4?",
    "question_en": "What does the host portion of an IPv4 address identify?",
    "options": [
      { "text_es": "La red completa a la que está conectado el dispositivo.", "text_en": "The entire network to which the device is connected.", "isCorrect": false },
      { "text_es": "La dirección física (MAC) del dispositivo.", "text_en": "The physical (MAC) address of the device.", "isCorrect": false },
      { "text_es": "Un dispositivo o interfaz específico y único dentro de su propia red o subred.", "text_en": "A specific and unique device or interface within its own network or subnet.", "isCorrect": true },
      { "text_es": "El tipo de sistema operativo que utiliza el dispositivo.", "text_en": "The type of operating system the device uses.", "isCorrect": false }
    ],
    "explanation_es": "La porción de host distingue a un dispositivo individual de todos los demás dispositivos que se encuentran en la misma red o subred. Debe ser única dentro de esa red específica.",
    "explanation_en": "The host portion distinguishes an individual device from all other devices located on the same network or subnet. It must be unique within that specific network."
  },
  {
    "id": "portions_q4",
    "category": "1.0-network-fundamentals",
    "question_es": "Para que dos computadoras puedan comunicarse directamente dentro de la misma subred IP, la porción de host de sus direcciones IP debe ser idéntica.",
    "question_en": "For two computers to communicate directly within the same IP subnet, the host portion of their IP addresses must be identical.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": false },
      { "text_es": "Falso", "text_en": "False", "isCorrect": true }
    ],
    "explanation_es": "Para estar en la misma subred, deben compartir la misma porción de red. La porción de host debe ser única para cada dispositivo dentro de esa subred para poder diferenciarlos.",
    "explanation_en": "To be on the same subnet, they must share the same network portion. The host portion must be unique for each device within that subnet to differentiate them."
  },
  {
    "id": "portions_q5",
    "category": "1.0-network-fundamentals",
    "question_es": "Considera la analogía de una dirección postal (Calle Falsa 123). ¿Qué parte de la dirección IP se asemeja más al \"Nombre de la Calle\" (Calle Falsa)?",
    "question_en": "Consider the analogy of a postal address (123 Fake Street). Which part of the IP address is most similar to the \"Street Name\" (Fake Street)?",
    "options": [
      { "text_es": "La dirección IP completa.", "text_en": "The complete IP address.", "isCorrect": false },
      { "text_es": "La porción de host.", "text_en": "The host portion.", "isCorrect": false },
      { "text_es": "La porción de red.", "text_en": "The network portion.", "isCorrect": true },
      { "text_es": "La máscara de subred.", "text_en": "The subnet mask.", "isCorrect": false }
    ],
    "explanation_es": "En la analogía común, el nombre de la calle representa el grupo (la red) donde se encuentran varias casas, similar a cómo la porción de red identifica la red donde residen varios hosts.",
    "explanation_en": "In the common analogy, the street name represents the group (the network) where several houses are located, similar to how the network portion identifies the network where various hosts reside."
  },
  {
    "id": "portions_q6",
    "category": "1.0-network-fundamentals",
    "question_es": "Usando la misma analogía de dirección postal (Calle Falsa 123), ¿qué parte de la dirección IP se asemeja más al \"Número de Casa\" (123)?",
    "question_en": "Using the same postal address analogy (123 Fake Street), which part of the IP address is most similar to the \"House Number\" (123)?",
    "options": [
      { "text_es": "La porción de red.", "text_en": "The network portion.", "isCorrect": false },
      { "text_es": "La dirección MAC.", "text_en": "The MAC address.", "isCorrect": false },
      { "text_es": "La máscara de subred.", "text_en": "The subnet mask.", "isCorrect": false },
      { "text_es": "La porción de host.", "text_en": "The host portion.", "isCorrect": true }
    ],
    "explanation_es": "El número de casa identifica una residencia específica dentro de una calle, al igual que la porción de host identifica a un dispositivo específico dentro de una red determinada por la porción de red.",
    "explanation_en": "The house number identifies a specific residence on a street, just as the host portion identifies a specific device within a network determined by the network portion."
  },
  {
    "id": "portions_q7",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuál de estas afirmaciones describe correctamente la relación entre dispositivos en la misma subred IP?",
    "question_en": "Which of these statements correctly describes the relationship between devices on the same IP subnet?",
    "options": [
      { "text_es": "Tienen porciones de red diferentes pero la misma porción de host.", "text_en": "They have different network portions but the same host portion.", "isCorrect": false },
      { "text_es": "Tienen la misma porción de red y porciones de host únicas.", "text_en": "They have the same network portion and unique host portions.", "isCorrect": true },
      { "text_es": "Tienen la misma porción de red y la misma porción de host.", "text_en": "They have the same network portion and the same host portion.", "isCorrect": false },
      { "text_es": "Tienen porciones de red y porciones de host completamente diferentes.", "text_en": "They have completely different network and host portions.", "isCorrect": false }
    ],
    "explanation_es": "La definición de pertenecer a la misma subred IP implica compartir la misma porción de red, mientras que cada dispositivo debe tener una porción de host diferente para ser identificado unívocamente dentro de esa subred.",
    "explanation_en": "The definition of belonging to the same IP subnet implies sharing the same network portion, while each device must have a different host portion to be uniquely identified within that subnet."
  },
  {
    "id": "portions_q8",
    "category": "1.0-network-fundamentals",
    "question_es": "La división entre la porción de red y la porción de host es siempre fija y ocurre exactamente después del segundo octeto en todas las direcciones IPv4.",
    "question_en": "The division between the network portion and the host portion is always fixed and occurs exactly after the second octet in all IPv4 addresses.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": false },
      { "text_es": "Falso", "text_en": "False", "isCorrect": true }
    ],
    "explanation_es": "El punto de división entre la porción de red y host varía y no es fijo. Es determinado por la máscara de subred asociada a la dirección IP.",
    "explanation_en": "The dividing point between the network and host portion varies and is not fixed. It is determined by the subnet mask associated with the IP address."
  },
  {
    "id": "portions_q9",
    "category": "1.0-network-fundamentals",
    "question_es": "El concepto de dividir una dirección IP en porción de red y porción de host es fundamental para:",
    "question_en": "The concept of dividing an IP address into a network portion and a host portion is fundamental for:",
    "options": [
      { "text_es": "Determinar el fabricante del hardware.", "text_en": "Determining the hardware manufacturer.", "isCorrect": false },
      { "text_es": "Establecer la velocidad de la conexión física.", "text_en": "Setting the speed of the physical connection.", "isCorrect": false },
      { "text_es": "Organizar las redes en grupos lógicos (subredes) y enrutar el tráfico entre ellas.", "text_en": "Organizing networks into logical groups (subnets) and routing traffic between them.", "isCorrect": true },
      { "text_es": "Asignar colores a los cables de red según el estándar.", "text_en": "Assigning colors to network cables according to the standard.", "isCorrect": false }
    ],
    "explanation_es": "Esta división lógica es la base del direccionamiento IP y el subnetting, permitiendo agrupar dispositivos y facilitar el enrutamiento eficiente de paquetes entre diferentes redes o subredes.",
    "explanation_en": "This logical division is the basis of IP addressing and subnetting, allowing devices to be grouped and facilitating efficient packet routing between different networks or subnets."
  },
  {
    "id": "portions_q10",
    "category": "1.0-network-fundamentals",
    "question_es": "Si un dispositivo A tiene la IP 192.168.1.50 y un dispositivo B tiene la IP 192.168.2.75, asumiendo una máscara común que define los primeros tres octetos como red, ¿qué se puede concluir?",
    "question_en": "If device A has the IP 192.168.1.50 and device B has the IP 192.168.2.75, assuming a common mask that defines the first three octets as the network, what can be concluded?",
    "options": [
      { "text_es": "Ambos dispositivos están en la misma red.", "text_en": "Both devices are on the same network.", "isCorrect": false },
      { "text_es": "Los dispositivos están en redes diferentes.", "text_en": "The devices are on different networks.", "isCorrect": true },
      { "text_es": "Ambos dispositivos tienen la misma porción de host.", "text_en": "Both devices have the same host portion.", "isCorrect": false },
      { "text_es": "El dispositivo A es un router y el B es una computadora.", "text_en": "Device A is a router and B is a computer.", "isCorrect": false }
    ],
    "explanation_es": "Si los primeros tres octetos definen la red, la porción de red de A es 192.168.1 y la de B es 192.168.2. Al ser diferentes, pertenecen a redes distintas según esa máscara.",
    "explanation_en": "If the first three octets define the network, A's network portion is 192.168.1 and B's is 192.168.2. Since they are different, they belong to different networks according to that mask."
  },
  {
    "id": "mask_q1",
    "category": "1.0-network-fundamentals",
    "question_es": "La máscara de subred es un número de 32 bits que funciona junto con una dirección IPv4 para indicar qué parte de la dirección identifica la red y qué parte identifica al host.",
    "question_en": "The subnet mask is a 32-bit number that works alongside an IPv4 address to indicate which part of the address identifies the network and which part identifies the host.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "Esta es la definición y propósito fundamental de la máscara de subred en el direccionamiento IPv4.",
    "explanation_en": "This is the fundamental definition and purpose of the subnet mask in IPv4 addressing."
  },
  {
    "id": "mask_q2",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuál es el propósito principal de utilizar una máscara de subred?",
    "question_en": "What is the primary purpose of using a subnet mask?",
    "options": [
      { "text_es": "Asignar automáticamente direcciones IP a los nuevos dispositivos.", "text_en": "Automatically assigning IP addresses to new devices.", "isCorrect": false },
      { "text_es": "Aumentar la velocidad de la conexión a Internet.", "text_en": "Increasing the speed of the Internet connection.", "isCorrect": false },
      { "text_es": "Traducir nombres de host a direcciones IP.", "text_en": "Translating hostnames to IP addresses.", "isCorrect": false },
      { "text_es": "Distinguir la porción de red de la porción de host en una dirección IP.", "text_en": "Distinguishing the network portion from the host portion in an IP address.", "isCorrect": true }
    ],
    "explanation_es": "La función esencial de la máscara de subred es definir el límite exacto entre los bits que pertenecen a la porción de red y los bits que pertenecen a la porción de host dentro de una dirección IP.",
    "explanation_en": "The essential function of the subnet mask is to define the exact boundary between the bits belonging to the network portion and the bits belonging to the host portion within an IP address."
  },
  {
    "id": "mask_q3",
    "category": "1.0-network-fundamentals",
    "question_es": "¿En qué formato se escriben comúnmente las máscaras de subred IPv4 para que sean legibles por humanos?",
    "question_en": "In which format are IPv4 subnet masks commonly written to be human-readable?",
    "options": [
      { "text_es": "Hexadecimal", "text_en": "Hexadecimal", "isCorrect": false },
      { "text_es": "Binario completo (32 bits)", "text_en": "Full binary (32 bits)", "isCorrect": false },
      { "text_es": "Decimal punteado (igual que las direcciones IPv4)", "text_en": "Dotted-decimal (same as IPv4 addresses)", "isCorrect": true },
      { "text_es": "Notación de nombres de dominio", "text_en": "Domain name notation", "isCorrect": false }
    ],
    "explanation_es": "Al igual que las direcciones IPv4, las máscaras de subred se representan típicamente en formato decimal punteado (cuatro números decimales separados por puntos, ej., 255.255.255.0) para facilitar su lectura y configuración.",
    "explanation_en": "Like IPv4 addresses, subnet masks are typically represented in dotted-decimal format (four decimal numbers separated by dots, e.g., 255.255.255.0) for ease of reading and configuration."
  },
  {
    "id": "mask_q4",
    "category": "1.0-network-fundamentals",
    "question_es": "En una máscara de subred, los números '255' (que corresponden a bits '1' en binario) indican generalmente la porción de host de la dirección IP.",
    "question_en": "In a subnet mask, the numbers '255' (which correspond to '1' bits in binary) generally indicate the host portion of the IP address.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": false },
      { "text_es": "Falso", "text_en": "False", "isCorrect": true }
    ],
    "explanation_es": "En la máscara de subred, los bits con valor '1' (representados como 255 en octetos completos) corresponden a la porción de red. Los bits con valor '0' corresponden a la porción de host.",
    "explanation_en": "In the subnet mask, bits with a value of '1' (represented as 255 in full octets) correspond to the network portion. Bits with a value of '0' correspond to the host portion."
  },
  {
    "id": "mask_q5",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Qué indica la máscara de subred 255.255.255.0 sobre una dirección IP asociada?",
    "question_en": "What does the subnet mask 255.255.255.0 indicate about an associated IP address?",
    "options": [
      { "text_es": "Que toda la dirección IP identifica a la red.", "text_en": "That the entire IP address identifies the network.", "isCorrect": false },
      { "text_es": "Que los primeros 8 bits (primer octeto) identifican la red y los restantes 24 bits identifican al host.", "text_en": "That the first 8 bits (first octet) identify the network and the remaining 24 bits identify the host.", "isCorrect": false },
      { "text_es": "Que los primeros 24 bits (primeros tres octetos) identifican la red y los últimos 8 bits (último octeto) identifican al host.", "text_en": "That the first 24 bits (first three octets) identify the network and the last 8 bits (last octet) identify the host.", "isCorrect": true },
      { "text_es": "Que toda la dirección IP identifica al host.", "text_en": "That the entire IP address identifies the host.", "isCorrect": false }
    ],
    "explanation_es": "La máscara 255.255.255.0 tiene 24 bits iniciales puestos a '1' (tres 255s) y los últimos 8 bits a '0'. Esto significa que los primeros 24 bits de la dirección IP son la porción de red, y los últimos 8 bits son la porción de host.",
    "explanation_en": "The mask 255.255.255.0 has the initial 24 bits set to '1' (three 255s) and the last 8 bits set to '0'. This means the first 24 bits of the IP address are the network portion, and the last 8 bits are the host portion."
  },
  {
    "id": "mask_q6",
    "category": "1.0-network-fundamentals",
    "question_es": "Al configurar una computadora en una red, ¿cuál de los siguientes elementos es la máscara de subred?",
    "question_en": "When configuring a computer on a network, which of the following elements is the subnet mask?",
    "options": [
      { "text_es": "192.168.1.100 (Ejemplo de dirección IP)", "text_en": "192.168.1.100 (Example IP address)", "isCorrect": false },
      { "text_es": "255.255.255.0 (Ejemplo de máscara de subred)", "text_en": "255.255.255.0 (Example subnet mask)", "isCorrect": true },
      { "text_es": "192.168.1.1 (Ejemplo de gateway)", "text_en": "192.168.1.1 (Example gateway)", "isCorrect": false },
      { "text_es": "8.8.8.8 (Ejemplo de servidor DNS)", "text_en": "8.8.8.8 (Example DNS server)", "isCorrect": false }
    ],
    "explanation_es": "Las máscaras de subred comúnmente usan valores como 255 para indicar la porción de red. 255.255.255.0 es un ejemplo típico de máscara, mientras que las otras opciones representan otros parámetros de configuración de red (IP, gateway, DNS).",
    "explanation_en": "Subnet masks commonly use values like 255 to indicate the network portion. 255.255.255.0 is a typical example of a mask, while the other options represent other network configuration parameters (IP, gateway, DNS)."
  },
  {
    "id": "mask_q7",
    "category": "1.0-network-fundamentals",
    "question_es": "Una máscara de subred y una dirección IP son esencialmente lo mismo y se pueden usar indistintamente.",
    "question_en": "A subnet mask and an IP address are essentially the same thing and can be used interchangeably.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": false },
      { "text_es": "Falso", "text_en": "False", "isCorrect": true }
    ],
    "explanation_es": "Aunque ambas son números de 32 bits y se escriben en formato similar, tienen propósitos completamente diferentes. La IP identifica/localiza al host, mientras que la máscara define la división red/host de esa IP. Siempre trabajan juntas.",
    "explanation_en": "Although both are 32-bit numbers and written in a similar format, they have completely different purposes. The IP identifies/locates the host, while the mask defines the network/host division of that IP. They always work together."
  },
  {
    "id": "mask_q8",
    "category": "1.0-network-fundamentals",
    "question_es": "En la representación binaria de una máscara de subred, ¿qué valor de bit (0 o 1) se utiliza para marcar las posiciones correspondientes a la porción de red?",
    "question_en": "In the binary representation of a subnet mask, which bit value (0 or 1) is used to mark the positions corresponding to the network portion?",
    "options": [
      { "text_es": "El bit 0", "text_en": "Bit 0", "isCorrect": false },
      { "text_es": "El bit 1", "text_en": "Bit 1", "isCorrect": true },
      { "text_es": "Se usan ambos (0 y 1) alternativamente.", "text_en": "Both (0 and 1) are used alternately.", "isCorrect": false },
      { "text_es": "Depende de la clase de dirección IP.", "text_en": "It depends on the IP address class.", "isCorrect": false }
    ],
    "explanation_es": "Por convención, en la máscara de subred binaria, los bits puestos a '1' indican las posiciones que pertenecen a la porción de red de la dirección IP asociada.",
    "explanation_en": "By convention, in the binary subnet mask, bits set to '1' indicate the positions belonging to the network portion of the associated IP address."
  },
  {
    "id": "mask_q9",
    "category": "1.0-network-fundamentals",
    "question_es": "¿Cuál de las siguientes máscaras de subred es inválida según el formato y las reglas habituales?",
    "question_en": "Which of the following subnet masks is invalid according to the usual format and rules?",
    "options": [
      { "text_es": "255.255.0.0", "text_en": "255.255.0.0", "isCorrect": false },
      { "text_es": "255.0.0.0", "text_en": "255.0.0.0", "isCorrect": false },
      { "text_es": "255.255.255.255", "text_en": "255.255.255.255", "isCorrect": false },
      { "text_es": "255.255.1.255", "text_en": "255.255.1.255", "isCorrect": true }
    ],
    "explanation_es": "Las máscaras de subred válidas (contiguas) consisten en una secuencia de bits '1' seguida de una secuencia de bits '0'. En binario, 255.255.1.255 sería ...11111111.00000001.11111111, lo cual viola la regla de contigüidad (un '0' seguido de un '1').",
    "explanation_en": "Valid (contiguous) subnet masks consist of a sequence of '1' bits followed by a sequence of '0' bits. In binary, 255.255.1.255 would be ...11111111.00000001.11111111, which violates the contiguity rule (a '0' followed by a '1')."
  },
  {
    "id": "mask_q10",
    "category": "1.0-network-fundamentals",
    "question_es": "Sin una máscara de subred, un dispositivo IP no podría determinar si otra dirección IP está en su misma red local o en una red remota.",
    "question_en": "Without a subnet mask, an IP device could not determine if another IP address is on its own local network or on a remote network.",
    "options": [
      { "text_es": "Verdadero", "text_en": "True", "isCorrect": true },
      { "text_es": "Falso", "text_en": "False", "isCorrect": false }
    ],
    "explanation_es": "Un dispositivo aplica la máscara de subred a su propia IP y a la IP de destino para comparar las porciones de red resultantes. Si coinciden, el destino está en la red local; si no, está en una red remota y debe enviarse al gateway. La máscara es esencial para esta determinación.",
    "explanation_en": "A device applies the subnet mask to its own IP and the destination IP to compare the resulting network portions. If they match, the destination is on the local network; if not, it's on a remote network and must be sent to the gateway. The mask is essential for this determination."
  }
]

