[
  {
    "id": "ap_modes_q1",
    "category": "2.0-network-access",
    "isMultipleChoice": false,
    "topic": {
      "id": "2.6",
      "description_es": "Describir las arquitecturas inalámbricas de Cisco y los modos de AP",
      "description_en": "Describe Cisco Wireless Architectures and AP modes",
      "subtopic_id": "2.6",
      "subtopic_description": "AP Modes"
    },
    "question_es": "¿Qué modo de punto de acceso depende de un controlador centralizado para la gestión, el roaming y la configuración del SSID?",
    "question_en": "Which access point mode relies on a centralized controller for management, roaming, and SSID configuration?",
    "image": null,
    "code": null,
    "options": [
      { "text_es": "Modo Bridge", "text_en": "Bridge mode", "isCorrect": false },
      { "text_es": "Modo Repetidor", "text_en": "Repeater mode", "isCorrect": false },
      { "text_es": "Modo Autónomo", "text_en": "Autonomous mode", "isCorrect": false },
      { "text_es": "Modo Ligero (Lightweight)", "text_en": "Lightweight mode", "isCorrect": true }
    ],
    "explanation_es": "Los puntos de acceso en modo Ligero (Lightweight) están diseñados para ser gestionados por un Controlador de LAN Inalámbrica (WLC). El WLC centraliza la configuración, la gestión y las decisiones de roaming, lo que simplifica la administración de redes Wi-Fi a gran escala. En contraste, los AP en modo Autónomo se configuran y gestionan individualmente.",
    "explanation_en": "Lightweight mode access points are designed to be managed by a Wireless LAN Controller (WLC). The WLC centralizes configuration, management, and roaming decisions, which simplifies the administration of large-scale Wi-Fi networks. In contrast, Autonomous mode APs are configured and managed individually."
  },
  {
    "id": "lldp_config_q1",
    "category": "2.0-network-access",
    "isMultipleChoice": false,
    "topic": {
      "id": "2.3",
      "description_es": "Configurar y verificar protocolos de descubrimiento de Capa 2 (CDP y LLDP)",
      "description_en": "Configure and verify Layer 2 discovery protocols (Cisco Discovery Protocol and LLDP)",
      "subtopic_id": "2.3",
      "subtopic_description": "LLDP Configuration"
    },
    "question_es": "Consulte la información. Un ingeniero de redes debe actualizar la configuración en Switch2 para que envíe paquetes LLDP cada minuto y la información enviada a través de LLDP se considere válida durante 3 minutos. ¿Qué configuración debe aplicar el ingeniero?",
    "question_en": "Refer to the exhibit. A network engineer must update the configuration on Switch2 so that it sends LLDP packets every minute and the information sent via LLDP is refreshed every 3 minutes. Which configuration must the engineer apply?",
    "image": null,
    "code": "Switch2# show lldp\n\nGlobal LLDP Information:\nStatus: ACTIVE\nLLDP advertisements are sent every 30 seconds\nLLDP hold time advertised is 120 seconds\nLLDP interface reinitialization delay is 2 seconds",
    "options": [
      { "text_es": "Switch2(config)# lldp timer 1\nSwitch2(config)# lldp holdtime 3", "text_en": "Switch2(config)# lldp timer 1\nSwitch2(config)# lldp holdtime 3", "isCorrect": false },
      { "text_es": "Switch2(config)# lldp timer 60\nSwitch2(config)# lldp tlv-select 180", "text_en": "Switch2(config)# lldp timer 60\nSwitch2(config)# lldp tlv-select 180", "isCorrect": false },
      { "text_es": "Switch2(config)# lldp timer 60\nSwitch2(config)# lldp holdtime 180", "text_en": "Switch2(config)# lldp timer 60\nSwitch2(config)# lldp holdtime 180", "isCorrect": true },
      { "text_es": "Switch2(config)# lldp timer 1\nSwitch2(config)# lldp tlv-select 3", "text_en": "Switch2(config)# lldp timer 1\nSwitch2(config)# lldp tlv-select 3", "isCorrect": false }
    ],
    "explanation_es": "El comando `lldp timer` establece la frecuencia de envío de los anuncios LLDP en segundos. Para enviar paquetes cada minuto, el valor debe ser 60. El comando `lldp holdtime` establece el multiplicador que, junto con el timer, determina cuánto tiempo un dispositivo receptor debe mantener la información LLDP antes de descartarla; sin embargo, es práctica común y más claro configurarlo directamente en segundos, lo cual se logra al configurar el holdtime con el valor total deseado. Para 3 minutos, el valor es 180 segundos.",
    "explanation_en": "The `lldp timer` command sets the transmission frequency of LLDP advertisements in seconds. To send packets every minute, the value must be 60. The `lldp holdtime` command sets the multiplier that, along with the timer, determines how long a receiving device should keep LLDP information before discarding it; however, it's common and clearer to set this directly in total seconds by configuring the holdtime with the desired value. For 3 minutes, the value is 180 seconds."
  },
  {
    "id": "stp_portfast_states_q1",
    "category": "2.0-network-access",
    "isMultipleChoice": true,
    "topic": {
      "id": "2.5",
      "description_es": "Interpretar operaciones básicas de Rapid PVST+ Spanning Tree Protocol",
      "description_en": "Interpret basic operations of Rapid PVST+ Spanning Tree Protocol",
      "subtopic_id": "2.5.c",
      "subtopic_description": "PortFast"
    },
    "question_es": "¿Qué dos estados de spanning-tree se omiten en una interfaz que ejecuta PortFast? (Elija dos.)",
    "question_en": "Which two spanning-tree states are bypassed on an interface running PortFast? (Choose two.)",
    "image": null,
    "code": null,
    "options": [
      { "text_es": "blocking (bloqueo)", "text_en": "blocking", "isCorrect": false },
      { "text_es": "disabled (deshabilitado)", "text_en": "disabled", "isCorrect": false },
      { "text_es": "learning (aprendizaje)", "text_en": "learning", "isCorrect": true },
      { "text_es": "listening (escucha)", "text_en": "listening", "isCorrect": true },
      { "text_es": "forwarding (reenvío)", "text_en": "forwarding", "isCorrect": false }
    ],
    "explanation_es": "La función PortFast está diseñada para puertos de acceso conectados a dispositivos finales (como PCs o servidores). Permite que el puerto pase inmediatamente del estado de bloqueo (blocking) al de reenvío (forwarding), omitiendo los estados de escucha (listening) y aprendizaje (learning), que normalmente durarían 30 segundos en total (15s + 15s). Esto acelera la convergencia de la red y evita que los dispositivos finales tengan problemas para obtener una dirección IP a través de DHCP.",
    "explanation_en": "The PortFast feature is designed for access ports connected to end devices (like PCs or servers). It allows the port to transition immediately from the blocking state to the forwarding state, bypassing the listening and learning states, which would normally take a total of 30 seconds (15s + 15s). This speeds up network convergence and prevents end devices from having issues obtaining an IP address via DHCP."
  },
  {
    "id": "wlc_aaa_override_q1",
    "category": "2.0-network-access",
    "isMultipleChoice": false,
    "topic": {
      "id": "2.9",
      "description_es": "Interpretar la configuración de la GUI de la LAN inalámbrica para la conectividad del cliente, como la creación de WLAN, configuraciones de seguridad y ajustes avanzados",
      "description_en": "Interpret the wireless LAN GUI configuration for client connectivity, such as WLAN creation, security settings, and advanced settings",
      "subtopic_id": "2.9",
      "subtopic_description": "WLAN Advanced Settings"
    },
    "question_es": "Después de instalar un nuevo servidor Cisco ISE, ¿qué tarea debe realizar el ingeniero en el Cisco WLC para conectar clientes inalámbricos a una VLAN específica basándose en sus credenciales?",
    "question_en": "After installing a new Cisco ISE server, which task must the engineer perform on the Cisco WLC to connect wireless clients on a specific VLAN based on their credentials?",
    "image": null,
    "code": null,
    "options": [
      { "text_es": "Deshabilitar el Modo LAG en el Próximo Reinicio", "text_en": "Disable the LAG Mode on Next Reboot", "isCorrect": false },
      { "text_es": "Habilitar la Autorización de APs MIC contra auth-list o AAA", "text_en": "Enable the Authorize MIC APs against auth-list or AAA", "isCorrect": false },
      { "text_es": "Habilitar el RRM Dirigido por Eventos", "text_en": "Enable the Event Driven RRM", "isCorrect": false },
      { "text_es": "Habilitar la Sobrescritura de AAA (Allow AAA Override)", "text_en": "Enable the Allow AAA Override", "isCorrect": true }
    ],
    "explanation_es": "Para que un WLC asigne dinámicamente a un cliente a una VLAN específica basada en las credenciales verificadas por un servidor RADIUS (como Cisco ISE), la función 'Allow AAA Override' debe estar habilitada en la configuración de la WLAN (SSID). Esta opción permite que los atributos RADIUS enviados por el servidor ISE (como el ID de la VLAN, ACLs o perfiles de QoS) sobrescriban la configuración por defecto de la WLAN.",
    "explanation_en": "For a WLC to dynamically assign a client to a specific VLAN based on credentials verified by a RADIUS server (like Cisco ISE), the 'Allow AAA Override' feature must be enabled in the WLAN (SSID) configuration. This option allows the RADIUS attributes sent from the ISE server (such as VLAN ID, ACLs, or QoS profiles) to override the default settings of the WLAN."
  },
  {
    "id": "wlc_lag_reboot_q1",
    "category": "2.0-network-access",
    "isMultipleChoice": false,
    "topic": {
      "id": "2.7",
      "description_es": "Describir las conexiones de infraestructura física de los componentes de WLAN (AP, WLC, puertos de acceso/troncales y LAG)",
      "description_en": "Describe physical infrastructure connections of WLAN components (AP, WLC, access/trunk ports, and LAG)",
      "subtopic_id": "2.7",
      "subtopic_description": "LAG on WLC"
    },
    "question_es": "¿Cuál es un requisito al configurar o eliminar LAG en un WLC?",
    "question_en": "What is a requirement when configuring or removing LAG on a WLC?",
    "image": null,
    "code": null,
    "options": [
      { "text_es": "El controlador debe ser reiniciado después de habilitar o reconfigurar LAG.", "text_en": "The controller must be rebooted after enabling or reconfiguring LAG.", "isCorrect": true },
      { "text_es": "La interfaz de gestión debe ser reasignada si LAG es deshabilitado.", "text_en": "The management interface must be reassigned if LAG is disabled.", "isCorrect": false },
      { "text_es": "Los puertos de entrada y salida para el flujo de tráfico deben especificarse si LAG está habilitado.", "text_en": "The incoming and outgoing ports for traffic flow must be specified if LAG is enabled.", "isCorrect": false },
      { "text_es": "Se deben admitir múltiples interfaces sin etiquetar en el mismo puerto.", "text_en": "Multiple untagged interfaces on the same port must be supported.", "isCorrect": false }
    ],
    "explanation_es": "La habilitación o deshabilitación de Link Aggregation (LAG) en un Cisco Wireless LAN Controller (WLC) es un cambio fundamental en cómo el sistema maneja sus puertos físicos. Debido a la naturaleza de este cambio a nivel de sistema, el WLC requiere un reinicio para que la nueva configuración de LAG tenga efecto.",
    "explanation_en": "Enabling or disabling Link Aggregation (LAG) on a Cisco Wireless LAN Controller (WLC) is a fundamental change to how the system handles its physical ports. Due to the system-level nature of this change, the WLC requires a reboot for the new LAG configuration to take effect."
  },
  {
    "id": "rstp_states_q1",
    "category": "2.0-network-access",
    "isMultipleChoice": true,
    "topic": {
      "id": "2.5",
      "description_es": "Interpretar operaciones básicas de Rapid PVST+ Spanning Tree Protocol",
      "description_en": "Interpret basic operations of Rapid PVST+ Spanning Tree Protocol",
      "subtopic_id": "2.5.b",
      "subtopic_description": "Port states and roles"
    },
    "question_es": "Además de 'descartando' (discarding), ¿a través de qué dos estados transita el puerto de un switch mientras usa RSTP (802.1w)? (Elija dos.)",
    "question_en": "Aside from discarding, which two states does the switch port transition through while using RSTP (802.1w)? (Choose two.)",
    "image": null,
    "code": null,
    "options": [
      { "text_es": "listening (escucha)", "text_en": "listening", "isCorrect": false },
      { "text_es": "speaking (hablando)", "text_en": "speaking", "isCorrect": false },
      { "text_es": "blocking (bloqueo)", "text_en": "blocking", "isCorrect": false },
      { "text_es": "forwarding (reenvío)", "text_en": "forwarding", "isCorrect": true },
      { "text_es": "learning (aprendizaje)", "text_en": "learning", "isCorrect": true }
    ],
    "explanation_es": "RSTP (802.1w) optimiza el STP (802.1D) consolidando los cinco estados originales en tres. Los estados de STP 'disabled', 'blocking' y 'listening' se combinan en un único estado RSTP llamado 'discarding'. Por lo tanto, un puerto en RSTP transita de 'discarding' a 'learning' (aprendizaje) y finalmente a 'forwarding' (reenvío).",
    "explanation_en": "RSTP (802.1w) streamlines STP (802.1D) by consolidating the original five states into three. The STP states of 'disabled', 'blocking', and 'listening' are all combined into a single RSTP state called 'discarding'. Therefore, a port in RSTP transitions from 'discarding' to 'learning' and finally to 'forwarding'."
  },
  {
    "id": "wlc_lag_reason_q1",
    "category": "2.0-network-access",
    "isMultipleChoice": false,
    "topic": {
      "id": "2.7",
      "description_es": "Describir las conexiones de infraestructura física de los componentes de WLAN (AP, WLC, puertos de acceso/troncales y LAG)",
      "description_en": "Describe physical infrastructure connections of WLAN components (AP, WLC, access/trunk ports, and LAG)",
      "subtopic_id": "2.7",
      "subtopic_description": "LAG on WLC"
    },
    "question_es": "¿Cuál es una razón para implementar LAG en un Cisco WLC?",
    "question_en": "What is a reason to implement LAG on a Cisco WLC?",
    "image": null,
    "code": null,
    "options": [
      {
        "text_es": "Aumentar el rendimiento disponible en el enlace.",
        "text_en": "Increase the available throughput on the link.",
        "isCorrect": true
      },
      {
        "text_es": "Permitir la conmutación por error con estado (stateful failover) entre WLCs.",
        "text_en": "Allow for stateful failover between WLCs.",
        "isCorrect": false
      },
      {
        "text_es": "Aumentar la seguridad cifrando las tramas de gestión.",
        "text_en": "Increase security by encrypting management frames.",
        "isCorrect": false
      },
      {
        "text_es": "Habilitar que los puertos del switch conectado usen diferentes configuraciones de Capa 2.",
        "text_en": "Enable the connected switch ports to use different Layer 2 configurations.",
        "isCorrect": false
      }
    ],
    "explanation_es": "Link Aggregation (LAG) agrupa múltiples puertos físicos en un único enlace lógico (EtherChannel). Sus dos beneficios principales son: 1. **Aumento del rendimiento (throughput)** al sumar el ancho de banda de los enlaces individuales. 2. **Redundancia**, ya que si un enlace falla, el tráfico se redistribuye automáticamente por los enlaces restantes.",
    "explanation_en": "Link Aggregation (LAG) bundles multiple physical ports into a single logical link (EtherChannel). Its two main benefits are: 1. **Increased throughput** by summing the bandwidth of the individual links. 2. **Redundancy**, because if one link fails, traffic is automatically redistributed over the remaining links."
  }
]
